EDT/УТ/src/Documents/мгТарифыРасчетаНачисленийЗаОсновнуюРаботу/мгТарифыРасчетаНачисленийЗаОсновнуюРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгТарифыРасчетаНачисленийЗаОсновнуюРаботу</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>InformationRegister.мгТарифыПоКонтрагентам</registerRecords>
  <registerRecords>InformationRegister.мгТарифыОсновныхНачислений</registerRecords>
  <registerRecords>InformationRegister.мгТарифыПодъем</registerRecords>
  <registerRecords>InformationRegister.мгТарифыФрахт</registerRecords>
  <attributes>
    <name>Регион</name>
    <comment>Регион</comment>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеТарифа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТарифовДоставкаЗабор</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЗаказа</name>
      <type>
        <types>CatalogRef.мгКатегорииЗаказов</types>
        <types>CatalogRef.мгКатегорииЗабора</types>
      </type>
    </attributes>
    <attributes>
      <name>Территориальность</name>
      <type>
        <types>CatalogRef.мгЛокализацииЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаемныйЭкипаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобственныйЭкипажБезЭкспедитора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобственныйЭкипажСЭкспедиторомВодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СобственныйЭкипажСЭкспедиторомЭкспедитор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПешийКурьер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифа</name>
      <type>
        <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТарифовФрахт</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>EnumRef.мгУсловияФрахт</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТарифовЗаПодьемы</name>
    <attributes>
      <name>ВесоваяКатегория</name>
      <type>
        <types>CatalogRef.мгВесовыеКатегорииПодъема</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПодъема</name>
      <type>
        <types>EnumRef.ВидыПодъемовВодителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТарифовПоКонтрагентам</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/мгТарифыРасчетаНачисленийЗаОсновнуюРаботу/Forms/ФормаДокументаУпр/Module.bsl
&НаКлиенте
Процедура СписокЗаказовТипЗаказаПриИзменении(Элемент)
	
	//ТекущиеДанные = Элементы.СписокДоставкаЗабор.ТекущиеДанные;
	//Если ТекущиеДанные <> Неопределено Тогда
	//	Если ТекущиеДанные.ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Доставка") Тогда
	//		МассивТипов = Новый Массив;
	//		МассивТипов.Добавить(Тип("СправочникСсылка.мгКатегорииЗаказовДляРасчетаФОТ"));
	//		Элементы.СписокДоставкаЗаборКатегорияЗаказа.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	//	ИначеЕсли ТекущиеДанные.ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Забор") Тогда
	//		МассивТипов = Новый Массив;
	//		МассивТипов.Добавить(Тип("СправочникСсылка.мгКатегорииЗабора"));
	//		Элементы.СписокДоставкаЗаборКатегорияЗаказа.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоставкаЗаборКатегорияЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокДоставкаЗабор.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Доставка") Тогда
			ДанныеВыбора = ПолучитьДанныеВыбораКатегорияЗаказа(ТекущиеДанные.ТипЗаказа);
		ИначеЕсли ТекущиеДанные.ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Забор") Тогда
			ДанныеВыбора = ПолучитьДанныеВыбораКатегорияЗаказа(ТекущиеДанные.ТипЗаказа);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораКатегорияЗаказа(ТипЗаказа)
	
	ДанныеВыбора = Новый СписокЗначений;
	Если ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Доставка") Тогда
		СпрКатегории = Справочники.мгКатегорииЗаказов.Выбрать();
	ИначеЕсли ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Забор") Тогда
		СпрКатегории = Справочники.мгКатегорииЗабора.Выбрать();
	КонецЕсли;
	Пока СпрКатегории.Следующий() Цикл
		ДанныеВыбора.Добавить(СпрКатегории.Ссылка);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

&НаКлиенте
Процедура СписокДоставкаЗаборКатегорияЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокДоставкаЗаборКатегорияЗаказаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокДоставкаЗабор.ТекущиеДанные;
	ТекущиеДанные.КатегорияЗаказа = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	
КонецПроцедуры
